---
type: AnalyticalElement
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 11
tags: [revit-api, class]
---

# AnalyticalElement

`Autodesk.Revit.DB.Structure.AnalyticalElement` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetCurve | 2023 | `public Curve GetCurve ()` |
| Method | GetReference | 2023 | `public Reference GetReference ( AnalyticalModelSelector selector )` |
| Method | GetTransform | 2023 | `public Transform GetTransform ()` |
| Method | IsSingleCurve | 2023 | `public bool IsSingleCurve ()` |
| Method | IsValidAnalyzeAs | 2023 | `public bool IsValidAnalyzeAs ( AnalyzeAs analyzeAs )` |
| Method | IsValidSelector | 2023 | `public bool IsValidSelector ( AnalyticalModelSelector selector )` |
| Method | IsValidStructuralRole | 2023 | `public bool IsValidStructuralRole ( AnalyticalStructuralRole structuralRole )` |
| Property | AnalyzeAs | 2023 | `public AnalyzeAs AnalyzeAs { get ; set ; }` |
| Property | MaterialId | 2023 | `public ElementId MaterialId { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | StructuralRole | 2023 | `public AnalyticalStructuralRole StructuralRole { get ; set ; }` |